app/controllers/movies_controller.rb

SELECT DISTINCT "movies"."rating" FROM "movies"
SELECT "movies".* FROM "movies" WHERE (rating IN (NULL)) ORDER BY release_date
---
  def index
      #Movie.uniq.pluck(:rating)
      #http://stackoverflow.com/questions/9658881/rails-select-unique-values-from-a-column
      @all_ratings = Movie.uniq.pluck(:rating)
      params[:ratings] || @all_ratings.each { |v| params[:ratings] ||= {}; params[:ratings][v] = 1 }